In [26]:
import pandas as pd

In [27]:
print(pd.__version__)

2.2.3

# cheatcode
------------------------

.__version__

ورژن ماژول

.DataFrame(M)

ساخت دیتا فریم 

M.to_csv('A',index=False)

ذخیره به صورت اکسل

.read_csv("./A.csv")

خواندن فایل ها

M.sample()

انتخاب یکی از موارد

M.iloc[:,:2]

 تا ستون چند نمایش بده

M.iloc[:,:-1]

 تا یکی مانده به آخر

M.iloc[1:, -1]

ستون اخر

M.head()

5 سطر اول فقط

M.tail()

5 سطر آخر

M[' '].to_list()

تبدیل ستون خاص به لیست

M[' '].to_numpy()

تبدیل ستون خاص به بردار

M.describe()

اطلاعات کلی از دیتا

In [15]:
data={
    "name":["vahid","masoud","hamid"],
    "age":[36,41,43]
}
df=pd.DataFrame(data)
df

     name  age
0   vahid   36
1  masoud   41
2   hamid   43

ذخیره به عنوان فایل اکسل

In [28]:
df.to_csv("data1.csv",index=False)

خواندن دیتا از روی فایل

In [16]:
df=pd.read_csv("./data.csv")
df

    name  age  salary
0  vahid   36    1200
1   ramu   30    1800
2  dines   35    1800
3   bimu   22    1200
4    ali   33    1000
5   reza   43    2200

# انتخاب تصادفی یک سطر و سلول خاص و نمایش بدون جزئیات اضافی

In [17]:
import random
random_name=df.sample()
randomm=random_name["name"].to_string(index=False,header=False)
randomm

'dines'

In [18]:
dd=df.iloc[::]
dd

    name  age  salary
0  vahid   36    1200
1   ramu   30    1800
2  dines   35    1800
3   bimu   22    1200
4    ali   33    1000
5   reza   43    2200

# نمایش بر اساس ستون خاص

In [40]:
# تا ستون چند نمایش بده
ff=df.iloc[:,:2]

# تا یکی مانده به آخر
hh=df.iloc[:,:-1]

#ستون اخر
kk=df.iloc[1:, -1]

In [38]:
ff

    name  age
0  vahid   36
1   ramu   30
2  dines   35
3   bimu   22
4    ali   33
5   reza   43

In [39]:
hh

    name  age
0  vahid   36
1   ramu   30
2  dines   35
3   bimu   22
4    ali   33
5   reza   43

In [41]:
kk

1    1800
2    1800
3    1200
4    1000
5    2200
Name: salary, dtype: int64

نمایش یک خلاصه ای از دیتافریم

5 تا سطر رو نشون میده

In [19]:
df.head()

    name  age  salary
0  vahid   36    1200
1   ramu   30    1800
2  dines   35    1800
3   bimu   22    1200
4    ali   33    1000

با تعیین مقدار همان مقدار رو نشون میده

In [20]:
df.head(2)

    name  age  salary
0  vahid   36    1200
1   ramu   30    1800

پنچ تای آخر رو نشون میده

In [21]:
df.tail()

    name  age  salary
1   ramu   30    1800
2  dines   35    1800
3   bimu   22    1200
4    ali   33    1000
5   reza   43    2200

تبدیل داده ها به لیست

In [22]:
dflistage=df["age"].tolist()
type(dflistage)

list

In [42]:
dflistage

[36, 30, 35, 22, 33, 43]

اطلاعات کلی آماری از جمله میانگین مینیمم و ماکزیموم جدول را محاسبه می کنه

In [23]:
df.describe()

             age       salary
count   6.000000     6.000000
mean   33.166667  1533.333333
std     6.968979   467.618078
min    22.000000  1000.000000
25%    30.750000  1200.000000
50%    34.000000  1500.000000
75%    35.750000  1800.000000
max    43.000000  2200.000000

نمایش اطلاعات یک ستون مشخص

In [24]:
df["name"]

0    vahid
1     ramu
2    dines
3     bimu
4      ali
5     reza
Name: name, dtype: object

نمایش اطلاعات یک سطر خاص

In [25]:
df.iloc[2,:]

name      dines
age          35
salary     1800
Name: 2, dtype: object

In [8]:
df.iloc[4,2]

np.int64(1000)

انتخاب موارد خاص با فیلتر کردن

In [10]:
filter_df=df[df["salary"]>1300]
filter_df

    name  age  salary
1   ramu   30    1800
2  dines   35    1800
5   reza   43    2200

مرتب کردن اطلاعات

In [11]:
df_sorted=df.sort_values("salary")
df_sorted

    name  age  salary
4    ali   33    1000
0  vahid   36    1200
3   bimu   22    1200
1   ramu   30    1800
2  dines   35    1800
5   reza   43    2200

مرتب کردن از زیاد به کم

In [12]:
df_sorted2=df.sort_values("salary",ascending=False)
df_sorted2

    name  age  salary
5   reza   43    2200
1   ramu   30    1800
2  dines   35    1800
0  vahid   36    1200
3   bimu   22    1200
4    ali   33    1000

جدا کردن داده خاص از یک دیتا فریم

In [13]:
subset=df.loc[2:4,["name","age"]]
subset

    name  age
2  dines   35
3   bimu   22
4    ali   33

نحوه گروه بندی کردن داده ها

In [14]:
df_group=df.groupby("age")
df_group

In [32]:
df

    name  age      hobby
0  vahid   36        sky
1   ramu   30       swim
2  dines   35    footbal
3   bimu   22  vallyball
4    ali   33     tennis
5   reza   43     succer

In [16]:
df_group.count()

     name  salary
age
22      1       1
30      1       1
33      1       1
35      1       1
36      1       1
43      1       1

اضافه کردن یک ستون جدید به دیتا فریم

In [3]:
df["hobby"]=["sky","swim","footbal","vallyball","tennis","succer"]
df

NameError: name 'df' is not defined

حذف یک ستون

In [2]:
df

NameError: name 'df' is not defined

In [36]:
df_new=df.drop("salary",axis=1,inplace=False)
df_new

    name  age      hobby
0  vahid   36        sky
1   ramu   30       swim
2  dines   35    footbal
3   bimu   22  vallyball
4    ali   33     tennis
5   reza   43     succer

بدست آوردن تعداد سطرها

In [37]:
len(df)

6

اضافه کردن سطر جدید با مقادیر جدید

In [38]:
df

    name  age  salary      hobby
0  vahid   36    1200        sky
1   ramu   30    1800       swim
2  dines   35    1800    footbal
3   bimu   22    1200  vallyball
4    ali   33    1000     tennis
5   reza   43    2200     succer

In [41]:
df.loc[len(df)]={
    "name":"newitem",
    "age":22,
    "salary":2000
}
df

      name  age  salary      hobby
0    vahid   36    1200        sky
1     ramu   30    1800       swim
2    dines   35    1800    footbal
3     bimu   22    1200  vallyball
4      ali   33    1000     tennis
5     reza   43    2200     succer
6  newitem   22    2000   baseball
7  newitem   22    2000        NaN
8  newitem   22    2000        NaN

پیدا کردن مقدار های خالی و حذف آن

In [42]:
df.isna()

    name    age  salary  hobby
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False
3  False  False   False  False
4  False  False   False  False
5  False  False   False  False
6  False  False   False  False
7  False  False   False   True
8  False  False   False   True

حذف کردن سطری که خالیه یک فیلدش

In [43]:
df_delnan=df.dropna()
df_delnan

      name  age  salary      hobby
0    vahid   36    1200        sky
1     ramu   30    1800       swim
2    dines   35    1800    footbal
3     bimu   22    1200  vallyball
4      ali   33    1000     tennis
5     reza   43    2200     succer
6  newitem   22    2000   baseball

پر کردن خالی ها با مقدار خاص

In [45]:
df_fildfull=df.fillna(0)
df_fildfull

      name  age  salary      hobby
0    vahid   36    1200        sky
1     ramu   30    1800       swim
2    dines   35    1800    footbal
3     bimu   22    1200  vallyball
4      ali   33    1000     tennis
5     reza   43    2200     succer
6  newitem   22    2000   baseball
7  newitem   22    2000          0
8  newitem   22    2000          0

ذخیره دیتافریم ساخته شده

In [46]:
df_fildfull.to_csv("new_data.csv")

تبدیل داده ها به لیست

NameError: name 'df' is not defined